/***************************************************************************************************
 * 打印出所有“水仙花数”，所谓“水仙花数”是指一个三位数，其各位数字立方和等于该数本身。*********
 * 提示：153是一个“水仙花数”，因为153=1的三次方+5的三次方+3的三次方。* ************************
 */
/*
#include <stdio.h>
#include <stdlib.h>
main()
{
	int i, j, k, n;
	printf(" 'water flower'number is: ");
	for(n=100; n<=1000; n++)
	{
		i = n/100;
		j = n/10%10;
		k = n%10;
		if(i*100 + j*10 + k == i*i*i +j*j*j +k*k*k)
		{
			printf("%-4d", n);
		}
	}
	printf("\n");
}
*/
