/***************************************************************************************************
 ***********************************************将一个数组逆序输出**********************************
 ********************用第一个与最后一个交换********************************************************
 与16同样的问题！！！*/
/*
#include <stdio.h>
#include <stdlib.h>
#define N 5

main()
{
	int a[N]={9, 6, 5, 4, 1}, i, temp;
	printf("\n original arry:\n");
	for(i=0; i<N; i++)
		printf("%4d", a);
	for(i=0; i<N/2; i++)
	{
		temp = a;
		a = a[N-i-1];
		a[N-i-1] = temp;
	}
	printf("\n sorted array :\n");
	for(i=0; i<N; i++)
		printf("%4d", a);

}
*/
